# Задача 1.
# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
def division():
    num1 = float(input('Введите первое число: '))
    num2 = float(input('Введите второе число: '))
    if num2 == 0:
        return 'Делить на 0 нельзя'
    else:
        return num1 / num2


print(division())


def division():
    try:
        num1 = float(input('Введите первое число: '))
        num2 = float(input('Введите второе число: '))
        print(num1 / num2)
    except ZeroDivisionError:
        print('Делить на 0 нельзя')


division()


def division():
    try:
        num1 = float(input('Введите первое число: '))
        num2 = float(input('Введите второе число: '))
        return num1 / num2
    except ZeroDivisionError:
        return 'Делить на 0 нельзя'


print(division())


# Задача 2
# Реализовать функцию, принимающую несколько параметров,
# описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

def pers_inform(**kwargs):
    return kwargs


print(pers_inform(
    name=input('Введите имя: '),
    surname=input('Введите фамилию: '),
    dateofbirth=input('Введите дату рождения: '),
    city=input('Введите город рождения: '),
    email=input('Введите электронную почту: '),
    tel=input('Введите телефон: ')))


def personal_inform(**kwargs):
    return kwargs


print(personal_inform(name='name', surname='surname', dob='dob', city='city', email='email', tel='tel'))


# Задача 3
# Реализовать функцию my_func(), которая принимает три позиционных аргумента,
# и возвращает сумму наибольших двух аргументов.

def sum2out3():
    """"Принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов"""
    number1 = float(input('Введите первое число: '))
    number2 = float(input('Введите второе число: '))
    number3 = float(input('Введите третье число: '))
    return number1 + number2 + number3 - min(number1, number2, number3)


print(sum2out3())

# Задача 4
#  Программа принимает действительное положительное число x и целое отрицательное число y.
#  Необходимо выполнить возведение числа x в степень y.
#  Задание необходимо реализовать в виде функции my_func(x, y).
#  При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
x = float(input('Введите действительное положительное число x: '))
while x < 0:
    x = float(input('Введите действительное положительное число x: '))
y = int(input('Введите целое отрицательное число y: '))
while y > 0:
    y = int(input('Введите целое отрицательное число y: '))


def my_pow(x, y):
    try:
        return x ** y
    except ZeroDivisionError:
        return 'При возведение числа 0 в отрицательную степень происходит деление на ноль. Деление на ноль невозможно.'


print(my_pow(x, y))


# Задача 5
# Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

def strange_sum():
    """"Производит суммирование чисел с выводом подитога, до ввода символа 'Q' """
    my_sum = 0
    while True:
        numbers = list(input('Для выхода введите Q. Введите числа разделенные пробелом: ').split())
        if 'Q' in numbers:
            numbers.remove('Q')
            numbers = map(int, numbers)
            for el in numbers:
                my_sum += el
            return my_sum
        numbers = map(int, numbers)
        for el in numbers:
            my_sum += el
        print(my_sum)


print(strange_sum())


# Задача 6
# Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре.
# Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().
def int_func(word):
    """Возвращает введенные слова с заглавными первыми буквами."""
    return word.title()


text = input('Введите строку из слов в нижнем регистре, разделенных пробелом: ')
while not text.islower():
    print('Слова введены в неверном регистре')
    text = input('Введите строку из слов в нижнем регистре, разделенных пробелом: ')
print(int_func(text))