# __author__ ' Слинкин Кирилл Сергеевич'

# Задача №2

sec = int(input('Введите время в секундах, для перевода в формат чч:мм:сс: '))
h = int(sec / 3600)
m = int(sec % 3600 / 60)
s = int(sec % 3600 % 60)
print(f'{h:02}:{m:02}:{s:02}')

# Задача №3 "Действует только для положительных чисел "

n = int(input('Введите число: '))
m = str(n)
nn = m + m
nnn = m + m + m
summ = n + int(nn) + int(nnn)
print(f'{summ}')

# Задача №4

n = int(input('Введите целое положительное число: '))
m = n % 10
n = n // 10
while n > 0:
    if n % 10 > m:
        m = n % 10
    n = n // 10
print(m)

# Задача №5

V = float(input('Введите размер выручки фирмы: '))
I = float(input('Введите размер издержек фирмы: '))
if I > V:
    print(f'Размер убытков фирмы составляет: {I - V}')
else:
    print(f'Размер прибыли фирмы составляет: {V - I} ')
    print(f'Рентабельность выручки сотавляет: {(V - I) / V * 100} %')
    P = int(input('Введите количество работников для определения прибыли на каждого сотрудника: '))
    print(f'Размер прибыли в фирме в расчете на одного сотрудника составляет: {(V - I) / P}')

# # Задача №6

a = float(input('Введите значие а (дистанция в первый день): '))
b = float(input('Введите значие b (дистанция в n-ый день): '))
d = 1
while a / b < 1:
    d += 1
    a *= 1.1
print(f'Ответ: на {d}-й день спортсмен достиг результата — не менее {b} км.')
